In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("C:/Users/HP/Downloads/Documents/SE 544/Data sets/Book1.csv")
df

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53   Khulna  191792.06
2        153441.51       101145.55  407934.54  Barisal  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        141107.34        91391.77  366168.42   Khulna  166187.94

## 1. Encoding(Manually)

In [3]:
df.Area.unique()

array(['Dhaka', 'Khulna', 'Barisal'], dtype=object)

In [4]:
df.Area = df.Area.replace(['Dhaka', 'Khulna', 'Barisal'],['1', '2', '3'])

In [5]:
df.Area

0    1
1    2
2    3
3    1
4    2
Name: Area, dtype: object

## 2. Label Encoding

In [6]:
df = pd.read_csv("C:/Users/HP/Downloads/Documents/SE 544/Data sets/Book1.csv")
df

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53   Khulna  191792.06
2        153441.51       101145.55  407934.54  Barisal  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        141107.34        91391.77  366168.42   Khulna  166187.94

In [7]:
from sklearn.preprocessing import LabelEncoder

In [8]:
label = LabelEncoder()

In [9]:
df.Area = label.fit_transform(df['Area'])

In [10]:
df.Area

0    1
1    2
2    0
3    1
4    2
Name: Area, dtype: int32

## Using Loop for Label Encoding

In [12]:
df = pd.read_csv("C:/Users/HP/Downloads/Documents/SE 544/Data sets/Book1.csv")
df

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53   Khulna  191792.06
2        153441.51       101145.55  407934.54  Barisal  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        141107.34        91391.77  366168.42   Khulna  166187.94

In [13]:
for column in df.columns:
    if df[column].dtype == np.number:
        continue
    df[column] = label.fit_transform(df[column])

<ipython-input-13-dc0340216f35>:2: DeprecationWarning: Converting `np.inexact` or `np.floating` to a dtype is deprecated. The current result is `float64` which is not strictly correct.
  if df[column].dtype == np.number:

In [14]:
df.Area

0    1
1    2
2    0
3    1
4    2
Name: Area, dtype: int32

## 3. One-Hot Encoding

In [15]:
df = pd.read_csv("C:/Users/HP/Downloads/Documents/SE 544/Data sets/Book1.csv")
df

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53   Khulna  191792.06
2        153441.51       101145.55  407934.54  Barisal  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        141107.34        91391.77  366168.42   Khulna  166187.94

In [17]:
pd.get_dummies(df['Area'])

   Barisal  Dhaka  Khulna
0        0      1       0
1        0      0       1
2        1      0       0
3        0      1       0
4        0      0       1

In [20]:
##Dropping a column(Dimension Reduction)
d = pd.get_dummies(df['Area'], drop_first = True)

In [21]:
d

   Dhaka  Khulna
0      1       0
1      0       1
2      0       0
3      1       0
4      0       1

In [22]:
new_df = df.drop('Area',axis=1)

In [23]:
new_df

   Marketing Spend  Administration  Transport     Profit
0        114523.61       136897.80  471784.10  192261.83
1        162597.70       151377.59  443898.53  191792.06
2        153441.51       101145.55  407934.54  191050.39
3        144372.41       118671.85  383199.62  182901.99
4        141107.34        91391.77  366168.42  166187.94

In [24]:
df = pd.concat([new_df, d], axis=1)

In [25]:
df

   Marketing Spend  Administration  Transport     Profit  Dhaka  Khulna
0        114523.61       136897.80  471784.10  192261.83      1       0
1        162597.70       151377.59  443898.53  191792.06      0       1
2        153441.51       101145.55  407934.54  191050.39      0       0
3        144372.41       118671.85  383199.62  182901.99      1       0
4        141107.34        91391.77  366168.42  166187.94      0       1

## Ordinal Encoding

In [26]:
df = pd.read_csv("C:/Users/HP/Downloads/Documents/SE 544/Data sets/Book1.csv")
df

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53   Khulna  191792.06
2        153441.51       101145.55  407934.54  Barisal  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        141107.34        91391.77  366168.42   Khulna  166187.94

In [27]:
from sklearn.preprocessing import OrdinalEncoder

In [28]:
df.Area.unique()

array(['Dhaka', 'Khulna', 'Barisal'], dtype=object)

In [29]:
area = ['Dhaka', 'Khulna', 'Barisal']

In [30]:
ordinal = OrdinalEncoder(categories = [area])

In [31]:
encoded_values = ordinal.fit_transform(df[['Area']])

In [32]:
encoded_values

array([[0.],
       [1.],
       [2.],
       [0.],
       [1.]])

In [35]:
new_Area = pd.DataFrame(encoded_values, columns = ['Area'])

In [36]:
new_Area

   Area
0   0.0
1   1.0
2   2.0
3   0.0
4   1.0

In [37]:
df.Area = new_Area

In [38]:
df

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10   0.0  192261.83
1        162597.70       151377.59  443898.53   1.0  191792.06
2        153441.51       101145.55  407934.54   2.0  191050.39
3        144372.41       118671.85  383199.62   0.0  182901.99
4        141107.34        91391.77  366168.42   1.0  166187.94

## Hashing Encoding

In [2]:
df = pd.read_csv("C:/Users/HP/Downloads/Documents/SE 544/Data sets/Book1.csv")
df

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53   Khulna  191792.06
2        153441.51       101145.55  407934.54  Barisal  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        141107.34        91391.77  366168.42   Khulna  166187.94

In [4]:
import category_encoders as ce

In [8]:
e = ce.HashingEncoder(cols = 'Area', n_components = 3)

In [9]:
e.fit_transform(df)

   col_0  col_1  col_2  Marketing Spend  Administration  Transport     Profit
0      0      1      0        114523.61       136897.80  471784.10  192261.83
1      0      1      0        162597.70       151377.59  443898.53  191792.06
2      0      0      1        153441.51       101145.55  407934.54  191050.39
3      0      1      0        144372.41       118671.85  383199.62  182901.99
4      0      1      0        141107.34        91391.77  366168.42  166187.94

## Ordinal Encoding

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("C:/Users/HP/Downloads/Documents/SE 544/Data sets/Shop data.csv")
df

      age  income  gender m_status buys
0     <25    high    male   single   no
1     <25    high    male  married   no
2   25-35    high    male   single  yes
3     >35  medium    male   single  yes
4     >35     low  female   single  yes
5     >35     low  female   single   no
6   25-35     low  female  married  yes
7     <25  medium    male  married   no
8     <25     low  female   single  yes
9     >35  medium  female  married  yes
10    <25  medium  female   single  yes
11  25-35  medium    male  married  yes
12  25-35    high  female   single  yes
13    >35  medium    male  married   no
14    <25    high    male   single   no

In [3]:
df['income'].unique()

array(['high', 'medium', 'low'], dtype=object)

In [5]:
i_order = ['low','medium','high']

In [6]:
from sklearn.preprocessing import OrdinalEncoder

In [9]:
ordi = OrdinalEncoder(categories = [i_order])

In [10]:
ordi.fit(df[['income']])

OrdinalEncoder(categories=[['low', 'medium', 'high']])

In [12]:
final = pd.DataFrame(ordi.transform(df[['income']]))

In [13]:
final

      0
0   2.0
1   2.0
2   2.0
3   1.0
4   0.0
5   0.0
6   0.0
7   1.0
8   0.0
9   1.0
10  1.0
11  1.0
12  2.0
13  1.0
14  2.0

In [15]:
df['income'] = final

In [16]:
df

      age  income  gender m_status buys
0     <25     2.0    male   single   no
1     <25     2.0    male  married   no
2   25-35     2.0    male   single  yes
3     >35     1.0    male   single  yes
4     >35     0.0  female   single  yes
5     >35     0.0  female   single   no
6   25-35     0.0  female  married  yes
7     <25     1.0    male  married   no
8     <25     0.0  female   single  yes
9     >35     1.0  female  married  yes
10    <25     1.0  female   single  yes
11  25-35     1.0    male  married  yes
12  25-35     2.0  female   single  yes
13    >35     1.0    male  married   no
14    <25     2.0    male   single   no